#1.0.176
import random
word = ["紫","子","梓","芷","芃","聿","育","郁","鈺","文",
        "妏","玟","雯","芸","筠","紜","妘","心","歆","忻",
        "昕","妡","昀","妤","聆","姈","希","晞","曦","晰",
        "忛","凡","帆","怡","儀","頤","誼","悅","詩","思",
        "恩","穎","尹","瞳","婷","渟","庭","璇","映","盈",
        "晴","曉","筱","萱","軒","瑄","暄","諼","媛","緣",
        "苑","瑗","爰","曖","嬡","采","潔","絜","睫","婕",
        "韶","竺","筑","芝","之","芊","芍","羽","語","予",
        "伃","雪","虹","琪","琦","錡","祈","柔","媃","韻",
        "蘊","韵","音","茵","安","葳","唯","薇","若","湘",
        "珊","姍","倩","蒨","茜","涵","嫣","嘉","加","佳",
        "家","舒","書","品","雅","芳","方","君","郡","珺",
        "菌","茹","嬬","皓","嵐","蘭","乃","景","瑾","槿",
        "曄","棠","英","瑛","纓","櫻","晨","岑","閔","敏",
        "臻","真","媜","珍","蓁","楨","喬","惠","慧","蓉",
        "容","沛","佩","珮","姵","霈","羿","孟","菡","葦",
        "淨","靜","婧","瀞","佑","宥","姿","芮","沐","詠",
        "信","菁","寧","凝","甯","倪","霓"]
for i in range(20):
  a = random.randint(0,len(word)-1)
  b = random.randint(0,len(word)-1)
  print(word[a]+word[b],end=' ')